function calculateTaxRate(pollutantName) {
    const pollutantTaxRates = {
        'Азоту оксид': 2574.43,
        'Аміак': 482.84,
        'Ангідрид сірчистий': 2574.43,
        'Ацетон': 965.67,
        'Бензопірен': 3277278.63,
        'Бутилацетат': 579.84,
        'Ванадію п’ятиокис': 9656.78,
        'Водень хлористий': 96.99,
        'Вуглецю окис': 96.99,
        'Вуглеводні': 145.50,
        'Газоподібні фтористі сполуки': 6373.91,
        'Тверді речовини': 96.99,
        'Кадмій': 20376.22,
        'Марганець': 20376.22,
        'Нікель': 103816.62,
        'Озон': 2574.43,
        'Ртуть': 109127.84,
        'Свинець': 109127.84,
        'Сірководень': 8273.63,
        'Сірковуглець': 5376.59,
        'Спирт': 2574.43,
        'Стирол': 18799.08,
        'Фенол': 11685.10,
        'Хром': 69113.38,
        'Азот амонійний': 12883.84,
        'БСК 5': 5156.8,
        'Завислі речовини': 369.52,
        'Нафтопродукти': 75792.4,
        'Нітрати': 1108.56,
        'Нітрити': 63278.16,
        'Сульфати': 369.52,
        'Фосфати': 10297.44,
        'Хлориди': 369.52
    };

    // Перевіряємо чи є ставка податку для заданої речовини
    if (pollutantName in pollutantTaxRates) {
        return pollutantTaxRates[pollutantName];
    }

    // Якщо ставка не знайдена, повертаємо 0
    return 0;
}
